{
    "kanye-west-late-orchestration-lyrics": "Throw your diamonds in the sky if you feel the vibe The Roc is still alive every time I rhyme Forever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? Close your eyes and imagine, feel the magic Vegas on acid, seen through Yves St. Laurent glasses And I've realized that I've arrived 'Cause it take more than a magazine to kill my Vibe Does he write his own rhymes? Well, sort of, I think 'em That mean I forgot better shit than you ever thought of Damn, is he really that caught up? I ask, if you talkin' about classics, do my name get brought up? I remember I couldn't afford a Ford Escort Or even a four-track recorder So it's only right that I let the top drop on a drop-top Porsche Spoil yourself, that's important If your stripper name \"Porsche\" and you get tips from many men Then your fat friend, her nickname is \"Minivan\" Excuse me, that's just the Henny, man I smoke, I drink, I'm supposed to stop, I can't, because— Throw your diamonds in the sky if you feel the vibe The Roc is still alive every time I rhyme Forever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? I was sick about awards, couldn't nobody cure me Only playa that got robbed but kept all his jewelry Alicia Keys tried to talk some sense in him Thirty minutes later sein' there's no convincin' him What more could you ask for? The international asshole Who complain about what he is owed? And throw a tantrum like he is three years old You gotta love it though: somebody still speaks from his soul And wouldn't change by the change or the game or the fame When he came in the game, he made his own lane Now all I need is y'all to pronounce my name It's Kanye, but some of my plaques, they still say Kayne Got family in the D, Kin-folk from Motown Back in the Chi, them Folks ain't from Moe Town Life movin' too fast, I need to slow down Girl ain't give me no ass, you need to go down My father been said I need Jesus So he took me to church and let the water wash over my caesar The preacher said we need leaders Right then my body got still like a paraplegic You know who you call; you got a message, then leave it The Roc stand tall and you would never believe it Take your diamonds and throw 'em up like you bulimic Yeah, the beat cold, but the flow is anemic After debris settles and the dust get swept off Big K pick up where young Hov left off Right when magazines wrote Kanye West off I dropped my new shit, it sound like the best of A&R's lookin' like, \"Pssh, we messed up.\" Grammy night, damn right, we got dressed up Bottle after bottle 'til we got messed up In the studio, with Really Doe, yeah, he next up People askin' me if I'm gon' give my chain back That'll be the same day I give the game back You know the next question, dog: \"Yo, where Dame at?\" This track the Indian dance to bring our reign back \"What's up with you and Jay, man? Are y'all okay, man?\" They pray for the death of our dynasty like \"Amen\" R-r-r-r-right here stands a man With the power to make a diamond with his bare hands Throw your diamonds in the sky if you feel the vibe The Roc is still alive every time I rhyme Forever ever? Forever ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? Ever, ever? I gotta testify Come up in the spot lookin' extra fly 'Fore the day I die, I'ma touch the sky Gotta testify Come up in the spot lookin' extra fly 'Fore the day I die, I'ma touch the sky Back when they thought pink Polos would hurt the Roc Before Cam got the shit to pop The doors was closed I felt like Bad Boy's street team: I couldn't work the locks Now let's go, take 'em back to the plan Me and my momma hopped in that U-Haul van Any pessimists, I ain't talk to them Plus I ain't have no phone in my apart-a-ment Let's take 'em back to the club Least about an hour I stand on line I just wanted to dance, I went to Jacob an hour After I got my advance, I just wanted to shine Jay favorite line: \"Dawg, in due time!\" Now he look at me, like, \"Damn, dawg! You where I am!\" A hip-hop legend I think I died in that accident, ‘cause this must be Heaven I gotta testify Come up in the spot lookin' extra fly 'Fore the day I die, I'ma touch the sky Gotta testify Come up in the spot lookin' extra fly 'Fore the day I die, I'ma touch the sky Now let's take them hi-ah-igh-igh-igh-ighhhh (Top of the world, baby, top top of the world!) A-la-la-la-lah-la-lahhhhh (Top of the world, baby, on top of the world!) Back when Gucci was the shit to rock Back when Slick Rick got the shit to pop I'd do anything to say I got it Damn, them new loafers hurt my pocket Before anybody wanted K. West beats Me and my girl split the bucket at KFC Dog, I was havin' nervous breakdowns Like \"Man, these niggas that much better than me?\" Baby, I'm goin' on an aeroplane And I don't know if I'll be back again Sure enough, I sent the plane tickets But when she came to kick it, things became different Any girl I cheated on, sheets I skeeted on Couldn't keep it at home, thought I needed a Nia Long I'm tryin' to right my wrongs But it's funny them same wrongs helped me write this song I gotta testify Come up in the spot lookin' extra fly 'Fore the day you die, you gon' touch the sky You gon' touch the sky, baby girl, testify Come up in the spot lookin' extra fly 'Fore the day you die, you gon' touch the sky I gotta testify Come up in the spot lookin' extra fly 'Fore the day you die, you gon' touch the sky You gon' touch the sky, baby girl, testify Come up in the spot lookin' extra fly 'Fore the day you die, you gon' touch the sky We back at home, baby! Sky high, I’m, I’m sky high! I’m, I’m sky high! I’m, I’m sky high! I’m, I’m sky high! I’m, I’m sky high! Sky, sky high! I’m, I’m sky high! Yeah, keep it rollin'! Yeah, uh, feels good to be home, baby! Feels good to be home! That's that crack music nigga That real black music nigga La la la la la la la lah, la la la la la lah How we stop the Black Panthers? Ronald Reagan cooked up an answer You hear that? What Gil Scott was hearin' When our heroes or heroines got hooked on heroin Crack raised the murder rate in D.C. and Maryland We invested in that, it's like we got Merrill lynched And we been hangin' from the same tree ever since Sometimes I feel the music is the only medicine So we, cook it, cut it, measure it, bag it Sell it, the fiends cop it, nowadays they can't tell if That's that good shit, we ain't sure man Put the CD on your tongue, yeah that's pure man La la la la la la la lah, la la la la la lah That's that crack music nigga That real black music nigga La la la la la la la lah, la la la la la lah La la la la la la la lah, la la la la la lah From the place where the father's gone The mothers is hardly home And the Madigan's lock us up in the Audy Home How the Mexicans say, we just tryin' to party holmes They wanna pack us all in a box like styrofoam Who gave Saddam anthrax? George Bush got the answers Back in the hood it's a different type of chemical Arm & Hammer baking soda raised they own quota Right when our soldiers, ran for the stove 'cause 'Cause, dreams of being Hova Went from bein' a broke man to bein' a dopeman To bein' the President, look there's hope man This that inspiration for the Moes and the Folks man Shorty come and see his momma straight overdosin' And this is the soundtrack This the type of music that you make when you 'round that That's that crack music nigga That real black music nigga La la la la la la la lah, la la la la la lah La la la la la la la lah, la la la la la lah God, how could you let this happen That's that crack music, crack music That real black music, black music La la la la la la la lah, la la la la la lah La la la la la la la lah, la la la la la lah La la la la la la la lah, la la la la la lah La la la la la la la lah, la la la la la lah That's that crack music, crack music That real black music, black music La la la la la la la lah, la la la la la lah Drive slow, homie Drive slow, homie You never know, homie, might meet some hoes, homie You need to pump your brakes and drive slow, homie My homie Mali used to stay at 79th and May One of my best friends from back in the day Down the street from Calumet, a school full of Stones He nicknamed me K-Rock so they would leave me alone Bulls jacket with his hat broke way off And walked around the mall with his radio face off Plus he had the spinner from his Daytons in his hand Keys in his hand, reason again to let you know he's the man Back when we rocked Ellesses, he had dreams of Caprices Drove by the teachers, even more by polices How'd he get the cash? The day his father passed away Left him with a lil' somethin', sixteen, he was stuntin' Al B. Sure nigga with the hair all wavy Hit Lake Shore, girls go all crazy Hit the freeway, go at least 'bout eighty Boned so much that summer, even had him a baby See back-back then-then, if you had a car You was the Chi-Town version of Baby And I was just a virgin, a baby One of the reasons I looked up to him crazy I used to love to play my demo tape when the system yanked Felt like I was almost signed when the shit got cranked We'd take a Saturday and just circle the mall They had they Lincolns and Auroras, we was hurtin 'em all With the girls a lot of flirtin' involved, but dog Fuck all that flirtin', I'm tryin' to get in some drawers So put me on with these hoes, homie He told me don't rush to get grown, drive slow, homie Drive slow, homie Drive slow You never know, homie, might meet some hoes, homie You need to pump your brakes and drive slow, homie Drive slow, homie Drive slow, homie You never know, homie, might meet some hoes, homie You need to pump your brakes and drive slow, homie My car's like the movie, my car's like the crib I got more TVs in here than where I live Drive slow, homie Drive slow, homie You never know, homie, might meet some hoes, homie You need to pump your brakes and drive slow, homie Drive slow, homie Yo, Gee, they can't stop me from rappin', can they? Can they, Hop? Through the fire, to the limit, to the wall For a chance to be with you, I'd gladly risk it all Through the fire, through whatever, come what may For a chance at loving you, I'd take it all the way Right down to the wire, even through the fire I spit it through the wire, man There's too much stuff on my heart right now, man I'd gladly risk it all right now It's a life-or-death situation, man Y'all, y'all don't really understand how I feel right now, man It's your boy, Kanye to the… Chi-Town, what's goin' on? I drink a Boost for breakfast, an Ensure for dessert Somebody ordered pancakes, I just sip the sizzurp That right there could drive a sane man berserk Not to worry, Mr. H-to-the-Izzo's back to work How do you console my mom or give her light support Tellin' her her son's on life support? And just imagine how my girl feel On the plane scared as hell that her guy look like Emmett Till She was with me before the deal, she'd been tryna be mine She a Delta, so she'd been throwin' that Dynasty sign No use in me tryna be lyin', I been tryna be signed Tryin' to be a millionaire, how I used two lifelines In the same hospital where Biggie Smalls died The doctor said I had blood clots, but I ain't Jamaican, man Story on MTV and I ain't tryna make a band I swear, this right here, history in the makin', man Through the fire, to the limit, to the wall For a chance to be with you, I'd gladly risk it all Through the fire, through whatever, come what may For a chance at loving you, I'd take it all the way Right down to the wire, even through the fire I really apologize for everything right now If it's unclear at all, man They got my mouth wired shut For like… I dunno, the doctor said like six weeks Y'know, he had, I had reconstructive surgery on my jaw I looked in the mirror And half my jaw was in the back of my mouth, man I couldn't believe it But I'm still here for y'all right now, man This what I got to say right here, dawg Yeah, turn me up, yeah, uh What if somebody from the Chi' that was ill got a deal On the hottest rap label around? But he wasn't talkin' about coke and birds It was more like spoken word Except he's really puttin' it down? And he explained the story About how blacks came from glory And what we need to do in the game Good dude, bad night, right place, wrong time In the blink of a eye his whole life changed If you could feel how my face felt You would know how Mase felt Thank God I ain't too cool for the safe belt I swear to God, driver two wanna sue I got a lawyer for the case, to keep what's in my safe safe My dawgs couldn't tell if I… I looked like Tom Cruise in Vanilla Sky, it was televised There's been an accident like GEICO They thought I was burnt up like Pepsi did Michael I must got a angel, ‘cause look how death missed his ass Unbreakable, what, you thought they'd call me Mr. Glass? Look back on my life like the Ghost of Christmas Past Toys \"R\" Us where I used to spend that Christmas cash And I still won't grow up, I'm a grown-ass kid Swear I should be locked up for stupid shit that I did But I'm a champion, so I turned tragedy to triumph Make music that's fire, spit my soul through the wire Through the fire, to the limit, to the wall For a chance to be with you, I'd gladly risk it all Through the fire, through whatever, come what may For a chance at loving you, I'd take it all the way Right down to the wire, even through the fire Y'know what I'm sayin'? When the doctor told me I had, um That I was gonna have to have a plate in my chin, I said \"Dawg, don't you realize I'll never make it on a plane now?\" \"It's bad enough I got all this jewelry on!\" You can't be serious, man You just popped in the Kanye West Get Right for the Summer workout tape And ladies if you follow these instructions exactly You might be able to pull you a rapper, a NBA player Man, at least a dude with a car So first of all we gonna work on the stomach Nobody wants a little tight ass 1, and 2, and 3, and 4, and get them sit ups right, and Tuck your tummy tight and do your crunches like this Give head, stop breathe, get up, check your weave Don't drop the blunt and disrespect the weed Pick up your son and don't disrespect your seed It's a party tonight and ooh she's so excited Tell me who's invited: you, your friends and my dick What's scary to me is Henny makes girls look like Halle Berry to me So excuse me miss, I forgot your name Thank you, God bless you, good night I came, I came, I came It's been a week without me And she feel weak without me She wanna talk it out but Ain't nothing to talk about Unless she's talking about freaking out Then maybe we can work it out Work it out Work it out Work it out Work it out now Maybe we can work it out Oh girl your silhouette make me wanna light a cigarette My name Kanye from the Jigga set Twista said \"Get It Wet\" Ooh girl your breath is harsh! Cover your mouth up like you got SARS Off them tracks yea I bought them cars Still kill a nigga on 16 bars We ain't sweating to the oldies We juking to a cold beat Maybe one day girl we can bone So you can brag to all your homies now But I still mess with a big girl If you ain't fit girl, I'll still hit girl 1 and you brought 2 friends OK, 3 more now hop in the Benz 4-door - do you know the difference between a 5, 6, 7, 8 All the mocha lattes you gotta do Pilates You gotta pop this tape in before you start back dating Hustlers, gangstas, all us ballas It's been a week without me And she feel weak without me She wanna talk it out but Ain't nothing to talk about Unless she's talking about freaking out Then maybe we can work it out Work it out Work it out Work it out Work it out now Maybe we can work it out Work it out Juke it out Pump it out Shut 'em out Let's go out Lemme break ya wit' a piece of My favorite work out plan oh! oh! oh! I wanna see you work out yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah I wanna see you work out It's like that old Michael Jackson shit That's right put in work, move your ass, go berserk Eat your salad, no dessert Get that man you deserve It's Kanye's workout plan I said it's Kanye's workout plan Ladies and gentlemen It's Kanye's workout plan Allow myself to introduce myself His woooorrrrkkoouut plan This time around I want y'all to clap like this That's right, put in work Move your ass, go berserk Eat your salad, no dessert Get that man you deserve Stop! It's Kanye's workout plan Ok breathe I said it's Kanye's workout plan I know y'all ain't tired It's Kanye's workout plan But I hope not, 'cuz on this one I need ya His woooorrrrkkoouut plan To give me a soul clap ok? Double time That's right, put in work Woo! Move your ass, go berserk Ow! Eat your salad, no dessert Ugh! Get that man you deserve That's right, put in work Put in work Move your ass, go berserk Go wizzerk Eat your salad, no dessert No dessert Get that man you deserve You hear, ugh That's right, put in work That's right put in work Move your ass, go berserk Go wizzerk Eat your salad, no dessert Eat your salad, no dessert Get that man you deserve Woo! Okay, okay, okay, that's, that'd be good I appreciate your time I want to see you work out for me Woah, yeah Wake up Mr. West - Mr. West - Mr. West... Uh, yea, uh, yea, uh, yea And I heard 'em say, nothing's ever promised tomorrow today From the Chi, like Tim it's a harder way So this is in the name of love like Robert say Before you ask me to go get a job today Can I at least get a raise of the minimum wage? And I know that the government administer AIDS So I guess we just pray like the minister say Allāhu Akbar and throw in some hot cars Things we see on the screen that's not ours But these niggas from the hood so these dreams not far Where I'm from the dope boys is the rock stars But they can't cop cars without seeing cop cars I guess they want us all behind bars - I know it Uh, and I heard 'em say, nothing's ever promised tomorrow today And I heard 'em say Nothing's ever promised tomorrow today But we'll a find a way They say people in your life are seasons And anything that happen is for a reason And niggas gun clapping and keep to squeezing And Gran keep praying and keep believing In Jesus, and one day that you see him 'Til then walk in his footsteps and try to be him The devil is alive I feel him breathin Claiming money is the key, so keep on dreamin And put them lottery tickets just to tease us My Aunt Pam can't put them cigarettes down So now my little cousin smokin them cigarettes now His job try to claim that he too niggerish now Is it cause his skin blacker than licorice now I can't figure it out, I'm sick of it now Uh, and I heard 'em say, nothing's ever promised tomorrow today And I heard 'em say Nothing's ever promised tomorrow today But we'll a find a way We gon' to Mass today, we have to pray Besides what the pastor say, I have to say Since Pac passed away Most you rappers don't even deserve a track from me You see, if you ever wanted to ever be anything There'd always be somebody that shoot down any dream There'll always be haters, that's the way it is Hater niggas marry hater bitches and have hater kids But they gon' have to take my life 'fore they take my drive 'Cause when I was barely livin', that's what kept me alive Just the thought that maybe it could be better than what we at at this time Make it out of this grind, 'fore I'm out of my mind And get some leeway on the he say she say Your girl don't like me, how long has she been gay? Spanish girls say \"Yo, no hablo inglés\" And everybody want to run to me for their single It's funny how these wack niggas need my help Wasn't around when I couldn't feed myself Dawg, if I was you, I wouldn't feel myself Dawg, if I was you, I'd kill myself Made a mil' myself and I'm still myself And I'mma look in the mirror if I need some help Now I'll speak from the heart, y'all all frontin' Everybody feel a way about K but at least y'all feel something Yeah, this the real one, baby Uh, Chi-Town, stand up! Southside, Southside We gon' set this party off right Westside, Westside We gon' set this party off right Man, I promise, she's so self-conscious She has no idea what she doin' in college That major that she majored in don't make no money But she won't drop out, her parents'll look at her funny Now, tell me that ain't insecurr The concept of school seems so securr Sophomore, three yurrs, ain't picked a carurr She like, \"Fuck it, I'll just stay down hurr and do hair.\" ‘Cause that's enough money to buy her a few pairs Of new Airs, ‘cause her baby daddy don't really care She's so precious with the peer pressure Couldn't afford a car, so she named her daughter Alexis She had hair so long that it looked like weave Then she cut it all off, now she look like Eve And she be dealin' with some issues that you can't believe Single black female addicted to retail, and well And when it falls down, who you gon' call now? I'm tellin' you all, it all falls down C'mon, c'mon, and when it falls down Man, I promise, I'm so self-conscious That's why you always see me with at least one of my watches Rollie's and Pasha's done drove me crazy I can't even pronounce nothin', pass that Ver-say-see! Then I spent four hundred bucks on this Just to be like, \"Nigga, you ain't up on this.\" And I can't even go to the grocery store Without some Ones that's clean and a shirt with a team It seem we livin' the American Dream But the people highest up got the lowest self-esteem The prettiest people do the ugliest things For the road to riches and diamond rings We shine because they hate us, floss 'cause they degrade us We tryna buy back our 40 acres And for that paper, look how low we'll stoop Even if you in a Benz, you still a nigga in a coupe Come on, come on And when it falls down, who you gon' call now? Come on, come on And when it all falls down I say, \"Fuck the police,\" that's how I treat 'em We buy our way out of jail, but we can't buy freedom We'll buy a lot of clothes, but we don't really need 'em Things we buy to cover up what's inside 'Cause they made us hate ourself and love they wealth That's why shorty's hollerin', \"Where the ballers at?\" Drug dealer buy Jordan, crackhead buy crack And the white man get paid off of all of that But I ain't even gon' act holier than thou 'Cause fuck it, I went to Jacob with 25 thou Before I had a house and I'd do it again ‘Cause I wanna be on 106 & Park, pushin' a Benz I want to act ballerific like it's all terrific I got a couple past-due bills, I won't get specific I got a problem with spendin' before I get it We all self-conscious, I'm just the first to admit it C'mon, c'mon And when it falls down, who you gon' call now? C'mon c'mon, and when it falls down Southside, Southside We gon' set this party off right Westside, Westside We gon' set this party off right Chi-Town, Chi-Town We gon' show 'em how we get down Now, Syleena, you just like a safe belt, you saved my life C'mon Wished I had told ooh was the only one uh oh! But it's too late, it's too late he's gone You sweat her and I ain't talkin 'bout a Coogi You a Big L and I ain't talkin 'bout Cool J See me at the airport, at least twenty Louis Treat me like the Prince and this my sweet brother Numpsay Brother Numpsay! groupies say I'm too choosy Take em to the show and talk all through the movies Says she want diamonds, I took her to Ruby Tuesdays If we up in Fridays, I still have it my way Gone we striving home Gone I ride on chrome, it's too late Y'all don't want no prob' from me What you rappers could get is a job from me Maybe you could be my intern and in turn I'll show you how I cook up summer in the winter Aaron love the raw dog, when will he learn Caught something on the Usher tour, he had to let it burn Plus he already got three children Arguin' over babysitters like bitch it's yo turn \"Damn Ye it'd be stupid to diss you Even your superficial raps is super-official\" R-R-R-Roc Pastelle with Gucci on With TVs in the ride, throw a movie on Said he couldn't rap now he at the top with Doobie Long Cause I dookied on any song that they threw me on, gone We striving home We striving home, I ride on chrome Listen, homeboy, move on That's your best bet, why's that, Cons'? Uh-uh-uh, uh-uh-uh uh uh onnn, uh uh-uh onnn Uh-uh onnn, uh uh-uh I'm ahead of my time, sometimes years out So the powers that be won't let me get my ideas out And that make me wanna get my advance out And move to Oklahoma and just live at my aunt's house Yeah, I romance the thought of leaving it all behind Kanye step away from the lime Light like when I was on the grind In the 1-9-9-9 Before model chicks was bending over Or dealerships asked me \"Benz or Rover?\" Man, if I could just get one beat on Hova We could get up off this cheap-ass sofa What the summer of the Chi got to offer an eighteen-year-old? Sell drugs or get a job, you gotta play your role My dog worked at Taco Bell, hooked us up plural Fired a week later, the manager count the churros Sometimes I can't believe it when I look up in the mirro' How we out in Europe, spending Euros They claim you never know what you got 'til it's gone I know I got it, I don't know what y'all on I'ma open up a store for aspiring MCs Won't sell 'em no dream, but the inspiration is free But if they ever flip sides like Anakin You'll sell everything including the mannequin They got a new bitch, now you Jennifer Aniston Hold on I'll handle it, don't start panickin', stay calm Shorties at the door cause they need more Inspiration for they life, they souls, and they songs They said, \"Sorry, Mr. West is gone\" Little girl A-ha-ha-ha-ha.... Please stop your crying I'll be late for that, baby, I'll wait for that If you had a taste of that, you'd probably pay for that I'm comin' in when I feel like So turn this motherfucker up only if it feels right I'll be late for that, I can't wait for that I think I was made for that So I'm comin' in when I feel like So turn this motherfucker up only if it feels right Stop all your blood clot cryin', I was flyin' Made it to school with barely enough time to sign in Yeah, I hear the alarm, yeah, I hear you, Mom Yeah, yeah, I don't wan' be broke when I'm thirty-one They said the best classes go to the fastest, sorry, Mr. West There's no good classes, and that's what yo' ass get Not even electives? Not even prerequisites? You mean I missed my major by a couple of seconds? Now I'm in the shop class or the basket weavin' With all the rest of the motherfuckers underachievin' Man, this is an insult I went to junior high with all of them and they been slow If I can catch the beat then slow down the tempo Just throw this at the end if I'm too late for the intro Will I make it from the student loans to a Benzo? Like old folks pissin', I guess it all depends, oh, oh Stop your cryin', baby I'll be late for that, baby, I'll wait for that If you had a taste of that, you'd probably pay for that I'm comin' in when I feel like So turn this motherfucker up only if it feels right I'll be late for that, I can't wait for that I think I was made for that So I'm comin' in when I feel like So turn this motherfucker up only if it feels right You know when you be late you miss all the lights That's right that's right, that's right that's right And when you get back she gon' start up a fight That night that night, that night Baby, it's too late for that, lately I've been takin it slow Try and make it to the party 'fore the guest list close With the freshest hoes, the professors know We about to get real unprofessional Like them Eskimos, what would you do for a Klondike? Or two dykes that look Christina Milian-like? Hmm, I'll be on time for that I ain't thought of no line that could rhyme with that Yo, I'll be there in five minutes, five hours later? \"I'll be there in five minutes,\" go 'head, ride with it I'm so live with it, look how I did it Been bullshittin' but I finally arrived with it I know it's late and I took all year but You can stop complainin' 'cause I'm finally here, yeah We at war We at war with terrorism, racism But most of all we at war with ourselves God show me the way because the Devil tryna break me down You know what the Midwest is? Young and restless Where restless niggas might snatch your necklace And next these niggas might jack your Lexus Somebody tell these niggas who Kanye West is I walk through the valley of the Chi where death is Top floor the view alone will leave you breathless *gasps* Try to catch it *gasps* it's kinda hard Getting choked by detectives, yeah, yeah, now check the method They be askin' us questions, harass and arrest us Sayin' \"We eat pieces of shit like you for breakfast\" Huh? Y'all eat pieces of shit? What's the basis? We ain't going nowhere but got suits and cases A trunk full of coke, rental car from Avis My mama used to say only Jesus can save us Well mama I know I act a fool But I'll be gone 'til November, I got packs to move I hope God show me the way because the Devil's tryna break me down The only thing that I pray is that my feet don't fail me now And I don't think there's nothin' I can do now to right my wrongs I wanna talk to God but I'm afraid cause we ain't spoke in so long God show me the way because the Devil's tryna break me down The only thing that I pray is that my feet don't fail me now And I don't think there's nothin' I can do now to right my wrongs I wanna talk to God but I'm afraid cause we ain't spoke in so long So long, so long To the hustlers, killers, murderers, drug dealers, even the scrippers Jesus walks for them To the victims of welfare feel we livin' in Hell here, hell yeah Jesus walks for them Now, hear ye, hear ye, want to see Thee more clearly I know he hear me when my feet get weary Cause we're the almost nearly extinct We rappers is role models: we rap, we don't think I ain't here to argue about his facial features Or here to convert atheists into believers I'm just tryna say the way school need teachers The way Kathie Lee needed Regis, that's the way I need Jesus So here go my single dog, radio needs this They say you can rap about anything except for Jesus That means guns, sex, lies, videotape But if I talk about God my record won't get played, huh? Well if this take away from my spins Which'll probably take away from my ends Then I hope this take away from my sins And bring the day that I'm dreamin' about Next time I'm in the club, everybody screamin' out God show me the way because the Devil's tryna break me down The only thing that I pray is that my feet don't fail me now"
}