{
    "kanye-west-my-beautiful-dark-twisted-fantasy-lyrics": "Yeah yeah yeah yeah I fantasized 'bout this back in Chicago Mercy, mercy me, that Murcielago That's me, the first year that I blow How you say broke in Spanish? Me no hablo Me drown sorrow in that Diablo Me found bravery in my bravado DJs need to listen to the models \"You ain't got no fuckin' Yeezy in your Serato?\" (You ain't got no Yeezy, nigga?) Stupid, but what the hell do I know? I'm just a Chi-town nigga with a Nas flow And my chick in that new Phoebe Philo So much head, I woke up to Sleepy Hollow Look like a fat booty Celine Dion Sex is on fire, I'm the King of Leon-a Lewis Beyond the truest, hey, teacher, teacher Tell me how do you respond to students? And refresh the page and restart the memory? Respark the soul and rebuild the energy? We stopped the ignorance, we killed the enemies Sorry for the night demons still visit me The plan was to drink until the pain over But what's worse, the pain or the hangover? Fresh air, rollin' down the window Too many Urkels on your team, that's why your wins low Don't make me pull the toys out, huh Don't make me pull the toys And fire up the engines, huh And then they make noise At the mall, there was a seance Just kids, no parents Then the sky filled with herons in a Chrysler LeBaron And the hell, it wouldn't spare us And the fires did declare us But after that, took pills, kissed an heiress And woke up back in Paris Penitentiary chances, the devil dances And eventually answers to the call of Autumn All of them fallin’ for the love of ballin’ Got caught with 30 rocks, the cop look like Alec Baldwin Inter century anthems based off inner city tantrums Based off the way we was branded Face it, Jerome get more time than Brandon And at the airport they check all through my bag And tell me that it’s random But we stay winning, this week has been a bad massage I need a happy ending and a new beginning And a new fitted, and some job opportunities that's lucrative This the real world, homie, school finished They done stole your dreams, you dunno who did it I treat the cash the way the government treats AIDS I won’t be satisfied til all my niggas get it, get it? Is hip hop just a euphemism for a new religion? The soul music of the slaves that the youth is missing This is more than just my road to redemption Malcolm West had the whole nation standing at attention As long as I’m in Polo smiling, they think they got me But they would try to crack me if they ever see a black me I thought I chose a field where they couldn’t sack me If a nigga ain't shootin' a jump shot, running a track meet But this pimp is, at the top of Mount Olympus Ready for the World’s game, this is my Olympics We make ‘em say ho cause the game is so pimpish Choke a South Park writer with a fishstick I insisted to get up offa this dick And these drugs, niggas can't resist it Remind me of when they tried to have Ali enlisted If I ever wasn't the greatest nigga, I must have missed it! I need more drinks and less lights And that American Apparel girl in just tights She told the director she tryna get in a school He said “take them glasses off and get in the pool” It’s been a while since I watched the tube Cause like a Crip set, I got way too many blues for any more bad news I was looking at my resume feeling real fresh today They rewrite history, I don’t believe in yesterday And what’s a black Beatle anyway, a fucking roach? I guess that's why they got me sitting in fucking coach My guy said I need a different approach Cause people is looking at me like I’m sniffing coke It's not funny anymore, try different jokes Tell ‘em hug and kiss my ass, x and o And kiss the ring while they at it, do my thing while I got it Play strings for the dramatic ending of that wack shit Act like I ain't had a belt in two classes I ain't got it I’m coming after whoever who has it I’m coming after whoever. Who has it? You blowin' up, that’s good, fantastic That y’all, it's like that y'all I don’t really give a fuck about it at all Cause the same people that tried to black ball me Forgot about two things, my black balls I’m living in that 21st Century, doing something mean to it Do it better than anybody you ever seen do it Screams from the haters, got a nice ring to it I guess every superhero need his theme music No one man should have all that power The clock’s ticking, I just count the hours Stop tripping, I’m tripping off the power The system broken, the school is closed, the prison's open We ain’t got nothing to lose, motherfucker we rolling Huh? Motherfucker we rolling With some light-skinned girls and some Kelly Rowlands In this white man world, we the ones chosen So goodnight, cruel world, I’ll see you in the morning Huh? I’ll see you in the morning This is way too much, I need a moment No one man should have all that power The clock’s ticking, I just count the hours Stop tripping, I’m tripping off the power Till then, fuck that, the world’s ours And they say, and they say And they say, and they say And they say, and they say Fuck SNL and the whole cast Tell them Yeezy said they can kiss my whole ass More specifically they can kiss my asshole I’m an asshole? You niggas got jokes You short-minded niggas thoughts is Napoleon My furs is Mongolian, my ice brought the goalies in And I embody every characteristic of the egotistic He knows, he’s so fucking gifted I just needed time alone with my own thoughts Got treasures in my mind but couldn’t open up my own vault My childlike creativity, purity and honesty Is honestly being crowded by these grown thoughts Reality is catching up with me Taking my inner child, I’m fighting for custody With these responsibilities that they entrusted me As I look down at my diamond encrusted piece Thinking No one man should have all that power The clock’s ticking, I just count the hours Stop tripping, I’m tripping off the powder Till then, fuck that, the world’s ours And they say, and they say And they say, and they say And they say, and they say Colin Powells, Austin Powers Lost in translation with a whole fucking nation They say I was the abomination of Obama’s nation Well that’s a pretty bad way to start the conversation At the end of the day, god damn it I’m killing this shit I know damn well y’all feeling this shit I don’t need your pussy, bitch, I’m on my own dick I ain’t gotta power trip, who you going home with? How 'Ye doing? I’m surviving I was drinking earlier, now I’m driving Where the bad bitches, huh? Where you hiding? I got the power to make your life so exciting Now this will be a beautiful death Now this will be a beautiful death Now this will be a beautiful death You got the power to let power go? Something wrong, I hold my head MJ gone, our nigga dead I slapped my girl, she called the feds I did that time and spent that bread I’m heading home, I’m almost there I’m on my way, heading up the stairs To my surprise, a nigga replacing me I had to take him to that ghetto university Cop lights, flashlights, spotlights Strobe lights, street lights Fast life, drug life, thug life Rock life, every night Restraining order, can’t see my daughter Her mother, brother, grandmother hate me in that order Public visitation, we met at Borders Told her she take me back, I’ll be more supportive I made mistakes, I bumped my head Courts sucked me dry, I spent that bread She need her daddy, baby please Can’t let her grow up in that ghetto university Cop lights, flashlights, spotlights Strobe lights, street lights Fast life, drug life, thug life Rock life, every night Gossip, gossip, nigga just stop it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands at the concert Profit, profit, nigga I got it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands The best living or dead hands down, huh Less talk, more head right now, huh And my eyes more red than the devil is And I'm about to take it to another level, bitch No matter who you go and get, ain't nobody cold as this Do the rap and the track, triple double no assists And my only focus is staying on some bogus shit Arguing with my older bitch, acting like I owe her shit I heard that people sing raps to give the track pain Bought the chain that always give me back pain Fucking up my money so yeah I had to act sane Chi nigga but these hoes love my accent Chick came up to me and said, \"This the number to dial If you wanna make your #1 your #2 now\" Mix that Goose and Malibu, I call it \"Malibooyah\" Goddamn, Yeezy, how he hit 'em with a new style? Know that motherfucker well: \"What you gonna do now?\" Whatever I want to do. Gosh! It's cool now Know I'm gonna do, ah, it's the new now Think you motherfuckers really really need to cool out 'Cause you'll never get on top of this So mommy, best advice is just to get on top of this Have you ever had sex with a pharaoh? Put the pussy in a sarcophagus Now she claiming that I bruised her esophagus Head of the class and she just won a swallowship I'm living in the future so the present is my past My presence is a present, kiss my ass Gossip, gossip, nigga just stop it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands at the concert Profit, profit, nigga I got it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands Gossip, gossip, nigga just stop it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands at the concert Profit, profit, nigga I got it Everybody know I'm a motherfucking monster I'ma need to see your fucking hands at the concert I'ma need to see your fucking hands I'm so appalled, Spalding ball Balding Donald Trump taking dollars from y'all Baby, you're fired, your girlfriend hired But if you don't mind, I'ma keep you on call We above the law, we don't give a fuck about y'all I got dogs that'll chew a fucking hole through the wall But since they all lovers, I need more rubbers And if I don't use rubbers, need more covers Housekeeping, I mean goddamn One time let it be a bad bitch sweeping That know we get O's like Cheerios That know because they seen us in the videos That know the day that you play me Would be the same day MTV play videos That was a little joke, voila Praises due to the most high, Allah Praises due to the most fly, Prada Baby, I'm magic, tada Address me as your highness, high as United 30,000 feet up and you are not invited Niggas be writing bullshit like they gotta work Niggas is going through real shit, man, they out of work That's why another goddamn dance track gotta hurt That's why I'd rather spit something that got a purp' Ah, ah I love it though I love it though, y'know? Put your hands to the constellations The way you look should be a sin, you my sensation I know I’m preaching to the congregation We love Jesus but you done learned a lot from Satan I mean a nigga did a lot of waiting We ain't married but tonight I need some consummation May the Lord forgive us, may the gods be with us In that magic hour I seen good Christians Make rash decisions, oh she do it What happened to religion? Oh, she lose it She putting on her make up, she casually allure Text message break ups, the casualty of tour How she gon' wake up and not love me no more? I thought I was the asshole, I guess it’s rubbing off Hood phenomenon, the LeBron of rhyme Hard to be humble when you stunting on a jumbotron I’m looking at her like this what you really wanted, huh? Why we argue anyway? Oh, I forgot, it's summertime Put your hands to the constellations The way you look should be a sin, you my sensation I know I’m preaching to the congregation We love Jesus but she done learned a lot from Satan Satan, Satan, Satan I mean a nigga did a lot of waiting We ain't married but tonight I need some consummation When the sun go down it's the magic hour, the magic hour And outta all the colors that'll fill up the skies You got green on your mind, I can see it in your eyes Why you standing there with your face screwed up? Don’t leave while you're hot that’s how Mase screwed up Throwing shit around, the whole place screwed up Maybe I should call Mase so he could pray for us I hit the Jamaican spot, at the bar, take a seat I ordered the jerk, she said you are what you eat You see I always loved that sense of humor But tonight you should have seen how quiet the room was The Lyor Cohen of Dior Homme That's \"Dior Homme\", not \"Dior, homie\" The crib Scarface, could it be more Tony? You love me for me? Could you be more phony? Put your hands to the constellations The way you look should be a sin, you my sensation Haven’t said a word- Haven’t said a word to me this evening Cat got your tongue? And I always find, yeah, I always find something wrong You been putting up with my shit just way too long I'm so gifted at finding what I don't like the most So I think it's time for us to have a toast Let's have a toast for the douchebags Let's have a toast for the assholes Let's have a toast for the scumbags Every one of them that I know Let's have a toast for the jerk-offs That'll never take work off Baby, I got a plan Run away fast as you can She find pictures in my e-mail I sent this bitch a picture of my dick I don't know what it is with females But I'm not too good with that shit See, I could have me a good girl And still be addicted to them hoodrats And I just blame everything on you At least you know that's what I'm good at And I always find, yeah, I always find Yeah I always find something wrong You been putting up with my shit just way too long I'm so gifted at finding what I don't like the most So I think it's time for us to have a toast Let's have a toast for the douchebags Let's have a toast for the assholes Let's have a toast for the scumbags Every one of them that I know Let's have a toast for the jerk-offs That'll never take work off Baby, I got a plan Run away fast as you can Run away from me, baby, run away Run away from me, baby, run away When it starts to get crazy, why can't she just, run away? Baby, I got a plan, run away fast as you can Never was much of a romantic I could never take the intimacy And I know I did damage Cause the look in your eyes is killing me I guess you are at an advantage Cause you can blame me for everything And I don't know how I'mma manage If one day you just up and leave And I always find, yeah, I always find something wrong You been putting up with my shit just way too long I'm so gifted at finding what I don't like the most So I think it's time for us to have a toast Let's have a toast for the douchebags Let's have a toast for the assholes Let's have a toast for the scumbags Every one of them that I know Let's have a toast for the jerk-offs That'll never take work off Baby, I got a plan Run away fast as you can I think I just fell in love with a porn star Turn the camera on, she a born star Turn the corners in a foreign car Call the coroners, do the CPR She gave that old nigga a ulcer Her bittersweet taste made his gold teeth ache Make her knees shake, make a priest faint Make a nun cum, make her cremate Move downtown, cop a sweet space Livin’ life like we won the sweepstakes, what We headed to hell for heaven’s sakes, huh Well I’mma levitate, make the devil wait, yeah! Have you lost your mind? Tell me when you think we crossed the line No more drugs for me, pussy and religion is all I need Grab my hand and baby we’ll live a hell of a life Never in your wildest dreams Never in your wildest dreams, in your wildest You could hear the loudest screams Comin’ from inside the screen, you a wild bitch Tell me what I gotta do to be that guy Said her price go down, she ever fuck a black guy Or do anal, or do a gangbang It’s kinda crazy that’s all considered the same thing Well I guess a lotta niggas do gang bang And if we run trains, we all in the same gang Runaway slaves all on a chain gang Bang, bang, bang, bang, bang Have you lost your mind? Tell me when you think we crossed the line No more drugs for me, pussy and religion is all I need Grab my hand and baby we’ll live a hell of a life One day I’m gon' marry a porn star We’ll have a big-ass crib and a long yard We’ll have a mansion and some fly maids Nothin’ to hide, we both screwed the bridesmaids She wanna role play, 'til I roll over I’mma need a whole day, at least rolled doja What party is we goin’ to on Oscar day 'specially if she can’t get that dress from Oscar de La Renta, they wouldn’t rent her, they couldn’t take the shame Snatched the dress off her back and told her, “Get away” How could you say they live they life wrong? When you never fuck with the lights on Have you lost your mind? Tell me when you think we crossed the line No more drugs for me, pussy and religion is all I need Grab my hand and baby we’ll live a hell of a life I think I fell in love with a porn star And got married in a bathroom Honeymoon on the dance floor And got divorced by the end of the night That’s one hell of a life Whose fault? On a bathroom wall I wrote \"I'd rather argue with you than be with someone else\" I took a piss and dismiss it like \"fuck it\" And I went and found somebody else Fuck arguing and harvesting the feelings Yo, I'd rather be by my fucking self Till about two a.m. and I call back And I hang up and I start to blame myself Somebody help You weren't perfect but you made life worth it Stick around, some real feelings might surface Been a long time since I spoke to you in a bathroom Gripping you up, fucking and choking you What the hell was I supposed to do? I know you ain't getting this type of dick from that local dude And if you are I hope you have a good time Cause I definitely be having mine And you ain't finna see a mogul get emotional Every time I hear bout other niggas is strokin' you Lying, say I hit you, he sitting there consoling you Running my name through the mud, who's provoking you? You should be grateful a nigga like me ever noticed you Now you noticeable and can't nobody get control of you 1AM and can't nobody get a hold of you I'm calling your brother's phone like what was I supposed to do? Even though I knew, he never told the truth He was just gon' say whatever that you told him to At a certain point I had to stop asking questions Y'all got dirt on each other like mud wrestlers I heard he bought some coke with my money That ain't right girl You getting blackmailed for that white girl You always said, \"Yeezy, I ain't your right girl\" You'll probably find one of them \"I like art\"-type girls All of the lights, she-was-caught-in-the-hype girl And I was satisfied being in love with the lie Now who to blame, you to blame, me to blame For the pain and it poured every time when it rained Let's play the blame game Things used to be, now they not Anything but us is who we are Disguising ourselves as secret lovers We've become public enemies We walk away like strangers in the street Gone for eternity We erased one another So far from where we came With so much of everything, how do we leave with nothing? Lack of visual empathy equates the meaning of L-O-V-E Hatred and attitude tear us entirely Chloe Mitchell Let's play the blame game, I love you more Let's play the blame game for sure Let's call out names, names, I hate you, more Let's call out names, names, for sure I can't love you this much, I can't love you this much I can't love you this much, I can't love you this much I can't love you this much, no, I can't love you this much I can't love you this much, I can't love you this much And I know that you are somewhere doing your thing And when the phone called it just ring and ring You ain't pick up but your phone accidentally called me back And I heard the whole thing I heard the whole thing, the whole thing, the whole thing I'm lost in the world, been down my whole life I'm new in the city, and I'm down for the night Down for the night, said she’s down for the night I'm lost in the world, been down my whole life I'm new in the city, and I'm down for the night Down for the night, down for the night You're my devil, you're my angel You're my heaven, you're my hell You're my now, you're my forever You're my freedom, you're my jail You're my lies, you're my truth You're my war, you're my truce You're my questions, you're my proof You're my stress and you're my masseuse Ma-ma-se, ma-ma-se, ma-ma-ku-sa Lost in this plastic life Let's break out of this fake-ass party Turn this into a classic night If we die in each others arms Still get laid in the afterlife If we die in each others arms Still get laid, yeah, yeah, yeah Run from the lights, run from the night, run for your life Down for the night, down for the night, down for the night I'm lost in the world Been down my whole life I'm new in the city And I'm down for the night, down for the night Down for the night I'm lost in the world Been down my whole life I'm new in the city And I'm down for the night, down for the night I'm lost in the world Been down my whole life I'm new in the city But I'm down for the night, down for the night Oh, oh, get down"
}